using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace __Ясный_код
{
    /*
    

    parents1 - receiverParents
    // родители объекта приемника

    parents2 - sourceParents
    // родители объекта источника

    amount - totalHierarchyAmount
    // количество объекта с учетом количеств родительских объектов вверх по дереву до объекта головы 

    changes1 - mainReglamentChanges
    // список объектов (извещений об изменении), полученных по алгоритму основного регламента

    changes2 - tempReglamentChanges
    // список объектов (извещений об изменении), полученных по алгоритму временного регламента

    changes3 - migrationChanges
    // список объектов (извещений об изменении), полученных по результатам миграции данных

    key1 - selectedValueKey
    // переменная ключ для доступа к основному полю диалога

    key2 - changedValueKey
    // переменная ключ для доступа к дополнительному полю диалога (которое определяется автоматически в зависимости от значения selectedValueKey)

    key3 - hiddenValueKey
    // переменная ключ для доступа к дополнительному полю диалога (которое в большинстве случаев скрыто)

    obj - linkedObj
    // объект, полученный по специальной связи "Связанный объект"

    doc - readWriteDoc
    // объект класса Document с возможностью редактирования

    TPLinkToMany - СвязьНаТехнологическиеОбъекты
    // это Guid, пришел к тому, что названия статических переменных с гуидами лучше писать по-русски (вместо латинницы и комментария)


    */
}